def twice(fun, arg):
    """Вернуть результат применения функции fun дважды к аргументу arg"""
    pass


def foreach(funs, items):
    """Применить функции из массива funs к соответствующим элементам массива items"""
    pass


def apply(fun, args, kwargs):
    """Вернуть результат вызова функции fun с переданными позиционными и именными аргументами"""
    pass


def all_ternary(n):
    """Вернуть все троичные числа длины n в алфавитном порядке"""
    pass


def swap_arguments(fun):
    """Вернуть функцию, принимающую аргументы в противоположном от fun порядке"""
    pass
