def flatten(a):
    """Вернуть все числа, содержащиеся в массиве на любом уровне вложенности"""
    pass


def rprint(a, depth=1):
    """Вернуть строковое представление массива, обрезав его по глубине depth"""
    pass


# noinspection PyShadowingBuiltins
def pretty_rprint(a, print, *args, **kwargs):
    """Вывести массив, делая отступы, соответствующие уровню вложенности"""
    pass
