def flatten(a):
    """Вернуть все числа, содержащиеся в массиве на любом уровне вложенности"""
    pass


def rprint(a, depth, current_depth=0):
    """Вернуть строковое представление массива, обрезав его по глубине depth"""
    pass


# noinspection PyShadowingBuiltins
def pretty_rprint(a, current_depth=0, print=print):
    """Вывести массив, делая отступы, соответствующие уровню вложенности"""
    pass
